Revit 2024 API
IndexPoint Members
The IndexPoint type exposes the following members.
Constructors
Name | Description
IndexPoint
 Constructs the point primitive.
Methods
Name | Description
Dispose |  (Inherited from IndexPrimitive.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSizeInShortInts
 Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Index
 The index of the point's vertex.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from IndexPrimitive.)
See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace